import datetime
import pygetwindow as gw
import pyautogui as ag
import time
"""

░██╗░░░░░░░██╗░█████╗░██████╗░███╗░░██╗██╗███╗░░██╗░██████╗░██╗
░██║░░██╗░░██║██╔══██╗██╔══██╗████╗░██║██║████╗░██║██╔════╝░██║
░╚██╗████╗██╔╝███████║██████╔╝██╔██╗██║██║██╔██╗██║██║░░██╗░██║
░░████╔═████║░██╔══██║██╔══██╗██║╚████║██║██║╚████║██║░░╚██╗╚═╝
░░╚██╔╝░╚██╔╝░██║░░██║██║░░██║██║░╚███║██║██║░╚███║╚██████╔╝██╗
░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝

1. Если в первый раз программа написала, что не видит окно, запустите Discord и перезапустите программу)
2. Если программа при запуске открыла окно, то всё нормально
3. Чтобы отправить сообщение нужно написать его в текстовое поле и открыть соответствующий диалог. Discord можно свернуть.
"""


window = gw.getWindowsWithTitle('Discord')[0]

result_time: str = ("11:51")


def push_message():
    window.activate()
    time.sleep(0.5)
    ag.press("enter")


print("Программа работает")

if __name__ == "__main__":
    while True:
        if datetime.datetime.now().strftime("%H:%M") == result_time:
            push_message()
            print("Сообщение отправлено!")
            exit()
